# names = ['Оля', 'Петя', 'Вася', 'Маша']
#
# print('\n'.join(names))
#
# for i in names:
#     print(i + ' ' + str(len(i)))
#
# is_male = {'Оля': False,
#            'Петя': True,
#            'Вася': True,
#            'Маша': False}
#
# for i in is_male:
#     if is_male[i]:
#         print(i + " М")
#     if not is_male[i]:
#         print(i + " Ж")



# Задание 5
# Для каждой пары учеников нужно с новой строки перечислить учеников, которые в неё входят.
# Пример:
# Группа 1: Вася, Маша
# Группа 2: Оля, Петя, Гриша

groups = [
  ['Вася', 'Маша'],
  ['Оля', 'Петя', 'Гриша'],
]

print(groups[1])